app/controllers/friends_controller.rb

INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "twitter", "string", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @friend = Friend.new(friend_params)

    respond_to do |format|
      if @friend.save

UPDATE "friends" SET "string" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["string", "MEOW"], ["updated_at", "2023-06-25 09:02:30.369232"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @friend.update(friend_params)

DELETE FROM "friends" WHERE "friends"."id" = ?  [["id", 2]]
---
  def destroy
    @friend.destroy