app/controllers/stories_controller.rb

  def index
    @stories = Story.all
---
SELECT "stories".* FROM "stories"

  def create
    @story = Story.new(story_params)

    respond_to do |format|
      if @story.save
---
INSERT INTO "stories" ("story_id", "title", "text", "created_at", "updated_at", "storyLikes") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["story_id", 1], ["title", "Life at work"], ["text", "its good"], ["created_at", "2023-07-05 11:12:03.732710"], ["updated_at", "2023-07-05 11:12:03.732710"], ["storyLikes", nil]]

  def update
    respond_to do |format|
      if @story.update(story_params)
---
UPDATE "stories" SET "updated_at" = $1, "storyLikes" = $2 WHERE "stories"."id" = $3  [["updated_at", "2023-07-05 11:48:24.015004"], ["storyLikes", 5], ["id", 5]]

  def destroy
    @story.destroy
---
DELETE FROM "stories" WHERE "stories"."id" = $1  [["id", 1]]

    def set_story
      @story = Story.find(params[:id])
---
SELECT "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]